Yo-Mat/AFE_DevItem1/AFE DevItem1.cydsn/Generated_Source/PSoC6/I2C_0.h
/*******************************************************************************
* Function Name: I2C_0_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_0_Init(cy_stc_scb_i2c_config_t const *config)
{
    return Cy_SCB_I2C_Init(I2C_0_HW, config, &I2C_0_context);
}


/*******************************************************************************
*  Function Name: I2C_0_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_0_DeInit(void)
{
    Cy_SCB_I2C_DeInit(I2C_0_HW);
}


/*******************************************************************************
* Function Name: I2C_0_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_0_Enable(void)
{
    Cy_SCB_I2C_Enable(I2C_0_HW);
}


/*******************************************************************************
* Function Name: I2C_0_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_0_Disable(void)
{
    Cy_SCB_I2C_Disable(I2C_0_HW, &I2C_0_context);
}


/*******************************************************************************
* Function Name: I2C_0_SetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_0_SetDataRate(uint32_t dataRateHz, uint32_t scbClockHz)
{
    return Cy_SCB_I2C_SetDataRate(I2C_0_HW, dataRateHz, scbClockHz);
}


/*******************************************************************************
* Function Name: I2C_0_GetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_GetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_0_GetDataRate(uint32_t scbClockHz)
{
    return Cy_SCB_I2C_GetDataRate(I2C_0_HW, scbClockHz);
}


/*******************************************************************************
* Function Name: I2C_0_RegisterEventCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterEventCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_0_RegisterEventCallback(cy_cb_scb_i2c_handle_events_t callback)
{
    Cy_SCB_I2C_RegisterEventCallback(I2C_0_HW, callback, &I2C_0_context);
}


#if (I2C_0_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_0_RegisterAddrCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterAddrCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_0_RegisterAddrCallback(cy_cb_scb_i2c_handle_addr_t callback)
{
    Cy_SCB_I2C_RegisterAddrCallback(I2C_0_HW, callback, &I2C_0_context);
}
#endif /* (I2C_0_ENABLE_SLAVE) */


/*******************************************************************************
* Function Name: I2C_0_IsBusBusy
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_IsBusBusy() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool I2C_0_IsBusBusy(void)
{
    return Cy_SCB_I2C_IsBusBusy(I2C_0_HW);
}


#if (I2C_0_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_0_SlaveSetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_0_SlaveSetAddress(uint8_t addr)
{
    Cy_SCB_I2C_SlaveSetAddress(I2C_0_HW, addr);
}


/*******************************************************************************
* Function Name: I2C_0_SlaveGetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_0_SlaveGetAddress(void)
{
    return Cy_SCB_I2C_SlaveGetAddress(I2C_0_HW);
}


/*******************************************************************************
* Function Name: I2C_0_SlaveSetAddressMask
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveSetAddressMask() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_0_SlaveSetAddressMask(uint8_t addrMask)
{
    Cy_SCB_I2C_SlaveSetAddressMask(I2C_0_HW, addrMask);
}


/*******************************************************************************
* Function Name: I2C_0_SlaveGetAddressMask
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddressMask() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_0_SlaveGetAddressMask(void)
{
    return Cy_SCB_I2C_SlaveGetAddressMask(I2C_0_HW);
}
#endif /* (I2C_0_ENABLE_SLAVE) */

#if (I2C_0_ENABLE_MASTER)
/*******************************************************************************
* Function Name: I2C_0_MasterSetLowPhaseDutyCycle
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSetLowPhaseDutyCycle() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_0_MasterSetLowPhaseDutyCycle(uint32_t clockCycles)
{
    Cy_SCB_I2C_MasterSetLowPhaseDutyCycle(I2C_0_HW, clockCycles);
}


